zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_MCM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_LPE_MCM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_LPE_MCM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_LPE_MCM_H_)  /* Check if memory map has not been already included */
#define S32K566_LPE_MCM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPE_MCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPE_MCM_Peripheral_Access_Layer LPE_MCM Peripheral Access Layer
 * @{
 */

/** LPE_MCM - Size of Registers Arrays */
#define LPE_MCM_LMDR_COUNT                        2u

/** LPE_MCM - Register Layout Typedef */
typedef struct LPE_MCM_Struct {
  uint8_t RESERVED_0[8];
  __I  uint16_t PLASC;                             /**< Crossbar Switch (AXBS) Slave Configuration, offset: 0x8 */
  __I  uint16_t PLAMC;                             /**< Crossbar Switch (AXBS) Master Configuration, offset: 0xA */
  __IO uint32_t CPCR;                              /**< Core Platform Control Register, offset: 0xC */
  __IO uint32_t ISCR;                              /**< Interrupt Status and Control Register, offset: 0x10 */
  uint8_t RESERVED_1[28];
  __IO uint32_t PID;                               /**< Process ID Register, offset: 0x30 */
  uint8_t RESERVED_2[12];
  __IO uint32_t CPO;                               /**< Compute Operation Control Register, offset: 0x40 */
  uint8_t RESERVED_3[956];
  __IO uint32_t LMDR[LPE_MCM_LMDR_COUNT];          /**< Local Memory Descriptor Register, array offset: 0x400, array step: 0x4 */
  __IO uint32_t LMDR2;                             /**< Local Memory Descriptor Register2, offset: 0x408 */
  uint8_t RESERVED_4[116];
  __IO uint32_t LMPECR;                            /**< LMEM Parity and ECC Control Register, offset: 0x480 */
  uint8_t RESERVED_5[4];
  __IO uint32_t LMPEIR;                            /**< LMEM Parity and ECC Interrupt Register, offset: 0x488 */
  uint8_t RESERVED_6[4];
  __I  uint32_t LMFAR;                             /**< LMEM Fault Address Register, offset: 0x490 */
  __I  uint32_t LMFATR;                            /**< LMEM Fault Attribute Register, offset: 0x494 */
  uint8_t RESERVED_7[8];
  __I  uint32_t LMFDHR;                            /**< LMEM Fault Data High Register, offset: 0x4A0 */
  __I  uint32_t LMFDLR;                            /**< LMEM Fault Data Low Register, offset: 0x4A4 */
} LPE_MCM_Type, *LPE_MCM_MemMapPtr;

/** Number of instances of the LPE_MCM module. */
#define LPE_MCM_INSTANCE_COUNT                   (1u)

/* LPE_MCM - Peripheral instance base addresses */
/** Peripheral LPE_MCM base address */
#define IP_LPE_MCM_BASE                          (0xE0080000u)
/** Peripheral LPE_MCM base pointer */
#define IP_LPE_MCM                               ((LPE_MCM_Type *)IP_LPE_MCM_BASE)
/** Array initializer of LPE_MCM peripheral base addresses */
#define IP_LPE_MCM_BASE_ADDRS                    { IP_LPE_MCM_BASE }
/** Array initializer of LPE_MCM peripheral base pointers */
#define IP_LPE_MCM_BASE_PTRS                     { IP_LPE_MCM }

/* ----------------------------------------------------------------------------
   -- LPE_MCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPE_MCM_Register_Masks LPE_MCM Register Masks
 * @{
 */

/*! @name PLASC - Crossbar Switch (AXBS) Slave Configuration */
/*! @{ */

#define LPE_MCM_PLASC_ASC_MASK                   (0xFF00U)
#define LPE_MCM_PLASC_ASC_SHIFT                  (8U)
#define LPE_MCM_PLASC_ASC_WIDTH                  (8U)
#define LPE_MCM_PLASC_ASC(x)                     (((uint16_t)(((uint16_t)(x)) << LPE_MCM_PLASC_ASC_SHIFT)) & LPE_MCM_PLASC_ASC_MASK)
/*! @} */

/*! @name PLAMC - Crossbar Switch (AXBS) Master Configuration */
/*! @{ */

#define LPE_MCM_PLAMC_AMC_MASK                   (0xFF00U)
#define LPE_MCM_PLAMC_AMC_SHIFT                  (8U)
#define LPE_MCM_PLAMC_AMC_WIDTH                  (8U)
#define LPE_MCM_PLAMC_AMC(x)                     (((uint16_t)(((uint16_t)(x)) << LPE_MCM_PLAMC_AMC_SHIFT)) & LPE_MCM_PLAMC_AMC_MASK)
/*! @} */

/*! @name CPCR - Core Platform Control Register */
/*! @{ */

#define LPE_MCM_CPCR_SRAMLWP_MASK                (0x2U)
#define LPE_MCM_CPCR_SRAMLWP_SHIFT               (1U)
#define LPE_MCM_CPCR_SRAMLWP_WIDTH               (1U)
#define LPE_MCM_CPCR_SRAMLWP(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_SRAMLWP_SHIFT)) & LPE_MCM_CPCR_SRAMLWP_MASK)

