zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_MCM.h
#define LPE_MCM_CPCR_SRAMLAP_MASK                (0xCU)
#define LPE_MCM_CPCR_SRAMLAP_SHIFT               (2U)
#define LPE_MCM_CPCR_SRAMLAP_WIDTH               (2U)
#define LPE_MCM_CPCR_SRAMLAP(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_SRAMLAP_SHIFT)) & LPE_MCM_CPCR_SRAMLAP_MASK)

#define LPE_MCM_CPCR_SRAMUWP_MASK                (0x20U)
#define LPE_MCM_CPCR_SRAMUWP_SHIFT               (5U)
#define LPE_MCM_CPCR_SRAMUWP_WIDTH               (1U)
#define LPE_MCM_CPCR_SRAMUWP(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_SRAMUWP_SHIFT)) & LPE_MCM_CPCR_SRAMUWP_MASK)

#define LPE_MCM_CPCR_SRAMUAP_MASK                (0xC0U)
#define LPE_MCM_CPCR_SRAMUAP_SHIFT               (6U)
#define LPE_MCM_CPCR_SRAMUAP_WIDTH               (2U)
#define LPE_MCM_CPCR_SRAMUAP(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_SRAMUAP_SHIFT)) & LPE_MCM_CPCR_SRAMUAP_MASK)

#define LPE_MCM_CPCR_CBRR_MASK                   (0x400000U)
#define LPE_MCM_CPCR_CBRR_SHIFT                  (22U)
#define LPE_MCM_CPCR_CBRR_WIDTH                  (1U)
#define LPE_MCM_CPCR_CBRR(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_CBRR_SHIFT)) & LPE_MCM_CPCR_CBRR_MASK)

#define LPE_MCM_CPCR_PBRIDGE_IDLE_MASK           (0x2000000U)
#define LPE_MCM_CPCR_PBRIDGE_IDLE_SHIFT          (25U)
#define LPE_MCM_CPCR_PBRIDGE_IDLE_WIDTH          (1U)
#define LPE_MCM_CPCR_PBRIDGE_IDLE(x)             (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_PBRIDGE_IDLE_SHIFT)) & LPE_MCM_CPCR_PBRIDGE_IDLE_MASK)

#define LPE_MCM_CPCR_FMC_PF_IDLE_MASK            (0x8000000U)
#define LPE_MCM_CPCR_FMC_PF_IDLE_SHIFT           (27U)
#define LPE_MCM_CPCR_FMC_PF_IDLE_WIDTH           (1U)
#define LPE_MCM_CPCR_FMC_PF_IDLE(x)              (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_FMC_PF_IDLE_SHIFT)) & LPE_MCM_CPCR_FMC_PF_IDLE_MASK)

#define LPE_MCM_CPCR_AXBS_HLTD_MASK              (0x10000000U)
#define LPE_MCM_CPCR_AXBS_HLTD_SHIFT             (28U)
#define LPE_MCM_CPCR_AXBS_HLTD_WIDTH             (1U)
#define LPE_MCM_CPCR_AXBS_HLTD(x)                (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_AXBS_HLTD_SHIFT)) & LPE_MCM_CPCR_AXBS_HLTD_MASK)

#define LPE_MCM_CPCR_AXBS_HLT_REQ_MASK           (0x20000000U)
#define LPE_MCM_CPCR_AXBS_HLT_REQ_SHIFT          (29U)
#define LPE_MCM_CPCR_AXBS_HLT_REQ_WIDTH          (1U)
#define LPE_MCM_CPCR_AXBS_HLT_REQ(x)             (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_AXBS_HLT_REQ_SHIFT)) & LPE_MCM_CPCR_AXBS_HLT_REQ_MASK)

#define LPE_MCM_CPCR_HLT_FSM_ST_MASK             (0xC0000000U)
#define LPE_MCM_CPCR_HLT_FSM_ST_SHIFT            (30U)
#define LPE_MCM_CPCR_HLT_FSM_ST_WIDTH            (2U)
#define LPE_MCM_CPCR_HLT_FSM_ST(x)               (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPCR_HLT_FSM_ST_SHIFT)) & LPE_MCM_CPCR_HLT_FSM_ST_MASK)
/*! @} */

/*! @name ISCR - Interrupt Status and Control Register */
/*! @{ */

#define LPE_MCM_ISCR_FIDCE_MASK                  (0x1U)
#define LPE_MCM_ISCR_FIDCE_SHIFT                 (0U)
#define LPE_MCM_ISCR_FIDCE_WIDTH                 (1U)
#define LPE_MCM_ISCR_FIDCE(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FIDCE_SHIFT)) & LPE_MCM_ISCR_FIDCE_MASK)

#define LPE_MCM_ISCR_FIXCE_MASK                  (0x8U)
#define LPE_MCM_ISCR_FIXCE_SHIFT                 (3U)
#define LPE_MCM_ISCR_FIXCE_WIDTH                 (1U)
#define LPE_MCM_ISCR_FIXCE(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FIXCE_SHIFT)) & LPE_MCM_ISCR_FIXCE_MASK)

#define LPE_MCM_ISCR_FUFCE_MASK                  (0x10U)
#define LPE_MCM_ISCR_FUFCE_SHIFT                 (4U)
#define LPE_MCM_ISCR_FUFCE_WIDTH                 (1U)
#define LPE_MCM_ISCR_FUFCE(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FUFCE_SHIFT)) & LPE_MCM_ISCR_FUFCE_MASK)

#define LPE_MCM_ISCR_FOFCE_MASK                  (0x20U)
#define LPE_MCM_ISCR_FOFCE_SHIFT                 (5U)
#define LPE_MCM_ISCR_FOFCE_WIDTH                 (1U)
#define LPE_MCM_ISCR_FOFCE(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FOFCE_SHIFT)) & LPE_MCM_ISCR_FOFCE_MASK)

#define LPE_MCM_ISCR_FDZCE_MASK                  (0x40U)
#define LPE_MCM_ISCR_FDZCE_SHIFT                 (6U)
#define LPE_MCM_ISCR_FDZCE_WIDTH                 (1U)
#define LPE_MCM_ISCR_FDZCE(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FDZCE_SHIFT)) & LPE_MCM_ISCR_FDZCE_MASK)

#define LPE_MCM_ISCR_FIOCE_MASK                  (0x80U)
#define LPE_MCM_ISCR_FIOCE_SHIFT                 (7U)
#define LPE_MCM_ISCR_FIOCE_WIDTH                 (1U)
#define LPE_MCM_ISCR_FIOCE(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FIOCE_SHIFT)) & LPE_MCM_ISCR_FIOCE_MASK)

#define LPE_MCM_ISCR_FIDC_MASK                   (0x10000U)
#define LPE_MCM_ISCR_FIDC_SHIFT                  (16U)
#define LPE_MCM_ISCR_FIDC_WIDTH                  (1U)
#define LPE_MCM_ISCR_FIDC(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FIDC_SHIFT)) & LPE_MCM_ISCR_FIDC_MASK)

#define LPE_MCM_ISCR_FIXC_MASK                   (0x80000U)
#define LPE_MCM_ISCR_FIXC_SHIFT                  (19U)
#define LPE_MCM_ISCR_FIXC_WIDTH                  (1U)
#define LPE_MCM_ISCR_FIXC(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FIXC_SHIFT)) & LPE_MCM_ISCR_FIXC_MASK)

#define LPE_MCM_ISCR_FUFC_MASK                   (0x100000U)
#define LPE_MCM_ISCR_FUFC_SHIFT                  (20U)
#define LPE_MCM_ISCR_FUFC_WIDTH                  (1U)
#define LPE_MCM_ISCR_FUFC(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FUFC_SHIFT)) & LPE_MCM_ISCR_FUFC_MASK)

#define LPE_MCM_ISCR_FOFC_MASK                   (0x200000U)
#define LPE_MCM_ISCR_FOFC_SHIFT                  (21U)
#define LPE_MCM_ISCR_FOFC_WIDTH                  (1U)
#define LPE_MCM_ISCR_FOFC(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FOFC_SHIFT)) & LPE_MCM_ISCR_FOFC_MASK)

#define LPE_MCM_ISCR_FDZC_MASK                   (0x400000U)
#define LPE_MCM_ISCR_FDZC_SHIFT                  (22U)
#define LPE_MCM_ISCR_FDZC_WIDTH                  (1U)
#define LPE_MCM_ISCR_FDZC(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FDZC_SHIFT)) & LPE_MCM_ISCR_FDZC_MASK)

#define LPE_MCM_ISCR_FIOC_MASK                   (0x800000U)
#define LPE_MCM_ISCR_FIOC_SHIFT                  (23U)
#define LPE_MCM_ISCR_FIOC_WIDTH                  (1U)
#define LPE_MCM_ISCR_FIOC(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_ISCR_FIOC_SHIFT)) & LPE_MCM_ISCR_FIOC_MASK)
/*! @} */

