zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_MCM.h
/*! @name PID - Process ID Register */
/*! @{ */

#define LPE_MCM_PID_PID_MASK                     (0xFF000000U)
#define LPE_MCM_PID_PID_SHIFT                    (24U)
#define LPE_MCM_PID_PID_WIDTH                    (8U)
#define LPE_MCM_PID_PID(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_MCM_PID_PID_SHIFT)) & LPE_MCM_PID_PID_MASK)
/*! @} */

/*! @name CPO - Compute Operation Control Register */
/*! @{ */

#define LPE_MCM_CPO_CPOWOI_MASK                  (0x20000000U)
#define LPE_MCM_CPO_CPOWOI_SHIFT                 (29U)
#define LPE_MCM_CPO_CPOWOI_WIDTH                 (1U)
#define LPE_MCM_CPO_CPOWOI(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPO_CPOWOI_SHIFT)) & LPE_MCM_CPO_CPOWOI_MASK)

#define LPE_MCM_CPO_CPOACK_MASK                  (0x40000000U)
#define LPE_MCM_CPO_CPOACK_SHIFT                 (30U)
#define LPE_MCM_CPO_CPOACK_WIDTH                 (1U)
#define LPE_MCM_CPO_CPOACK(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPO_CPOACK_SHIFT)) & LPE_MCM_CPO_CPOACK_MASK)

#define LPE_MCM_CPO_CPOREQ_MASK                  (0x80000000U)
#define LPE_MCM_CPO_CPOREQ_SHIFT                 (31U)
#define LPE_MCM_CPO_CPOREQ_WIDTH                 (1U)
#define LPE_MCM_CPO_CPOREQ(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_CPO_CPOREQ_SHIFT)) & LPE_MCM_CPO_CPOREQ_MASK)
/*! @} */

/*! @name LMDR - Local Memory Descriptor Register */
/*! @{ */

#define LPE_MCM_LMDR_V_MASK                      (0x1U)
#define LPE_MCM_LMDR_V_SHIFT                     (0U)
#define LPE_MCM_LMDR_V_WIDTH                     (1U)
#define LPE_MCM_LMDR_V(x)                        (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_V_SHIFT)) & LPE_MCM_LMDR_V_MASK)

#define LPE_MCM_LMDR_LMSZH_MASK                  (0x8U)
#define LPE_MCM_LMDR_LMSZH_SHIFT                 (3U)
#define LPE_MCM_LMDR_LMSZH_WIDTH                 (1U)
#define LPE_MCM_LMDR_LMSZH(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_LMSZH_SHIFT)) & LPE_MCM_LMDR_LMSZH_MASK)

#define LPE_MCM_LMDR_LMSZ_MASK                   (0xF0U)
#define LPE_MCM_LMDR_LMSZ_SHIFT                  (4U)
#define LPE_MCM_LMDR_LMSZ_WIDTH                  (4U)
#define LPE_MCM_LMDR_LMSZ(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_LMSZ_SHIFT)) & LPE_MCM_LMDR_LMSZ_MASK)

#define LPE_MCM_LMDR_WY_MASK                     (0xF00U)
#define LPE_MCM_LMDR_WY_SHIFT                    (8U)
#define LPE_MCM_LMDR_WY_WIDTH                    (4U)
#define LPE_MCM_LMDR_WY(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_WY_SHIFT)) & LPE_MCM_LMDR_WY_MASK)

#define LPE_MCM_LMDR_DPW_MASK                    (0x7000U)
#define LPE_MCM_LMDR_DPW_SHIFT                   (12U)
#define LPE_MCM_LMDR_DPW_WIDTH                   (3U)
#define LPE_MCM_LMDR_DPW(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_DPW_SHIFT)) & LPE_MCM_LMDR_DPW_MASK)

#define LPE_MCM_LMDR_LOCK_MASK                   (0x8000U)
#define LPE_MCM_LMDR_LOCK_SHIFT                  (15U)
#define LPE_MCM_LMDR_LOCK_WIDTH                  (1U)
#define LPE_MCM_LMDR_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_LOCK_SHIFT)) & LPE_MCM_LMDR_LOCK_MASK)

#define LPE_MCM_LMDR_MT_MASK                     (0x70000U)
#define LPE_MCM_LMDR_MT_SHIFT                    (16U)
#define LPE_MCM_LMDR_MT_WIDTH                    (3U)
#define LPE_MCM_LMDR_MT(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_MT_SHIFT)) & LPE_MCM_LMDR_MT_MASK)

#define LPE_MCM_LMDR_CF0_MASK                    (0xF0000000U)
#define LPE_MCM_LMDR_CF0_SHIFT                   (28U)
#define LPE_MCM_LMDR_CF0_WIDTH                   (4U)
#define LPE_MCM_LMDR_CF0(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR_CF0_SHIFT)) & LPE_MCM_LMDR_CF0_MASK)
/*! @} */

/*! @name LMDR2 - Local Memory Descriptor Register2 */
/*! @{ */

#define LPE_MCM_LMDR2_V_MASK                     (0x1U)
#define LPE_MCM_LMDR2_V_SHIFT                    (0U)
#define LPE_MCM_LMDR2_V_WIDTH                    (1U)
#define LPE_MCM_LMDR2_V(x)                       (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_V_SHIFT)) & LPE_MCM_LMDR2_V_MASK)

#define LPE_MCM_LMDR2_LMSZH_MASK                 (0x8U)
#define LPE_MCM_LMDR2_LMSZH_SHIFT                (3U)
#define LPE_MCM_LMDR2_LMSZH_WIDTH                (1U)
#define LPE_MCM_LMDR2_LMSZH(x)                   (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_LMSZH_SHIFT)) & LPE_MCM_LMDR2_LMSZH_MASK)

#define LPE_MCM_LMDR2_LMSZ_MASK                  (0xF0U)
#define LPE_MCM_LMDR2_LMSZ_SHIFT                 (4U)
#define LPE_MCM_LMDR2_LMSZ_WIDTH                 (4U)
#define LPE_MCM_LMDR2_LMSZ(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_LMSZ_SHIFT)) & LPE_MCM_LMDR2_LMSZ_MASK)

#define LPE_MCM_LMDR2_WY_MASK                    (0xF00U)
#define LPE_MCM_LMDR2_WY_SHIFT                   (8U)
#define LPE_MCM_LMDR2_WY_WIDTH                   (4U)
#define LPE_MCM_LMDR2_WY(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_WY_SHIFT)) & LPE_MCM_LMDR2_WY_MASK)

#define LPE_MCM_LMDR2_DPW_MASK                   (0x7000U)
#define LPE_MCM_LMDR2_DPW_SHIFT                  (12U)
#define LPE_MCM_LMDR2_DPW_WIDTH                  (3U)
#define LPE_MCM_LMDR2_DPW(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_DPW_SHIFT)) & LPE_MCM_LMDR2_DPW_MASK)

#define LPE_MCM_LMDR2_LOCK_MASK                  (0x8000U)
#define LPE_MCM_LMDR2_LOCK_SHIFT                 (15U)
#define LPE_MCM_LMDR2_LOCK_WIDTH                 (1U)
#define LPE_MCM_LMDR2_LOCK(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_LOCK_SHIFT)) & LPE_MCM_LMDR2_LOCK_MASK)

#define LPE_MCM_LMDR2_MT_MASK                    (0x70000U)
#define LPE_MCM_LMDR2_MT_SHIFT                   (16U)
#define LPE_MCM_LMDR2_MT_WIDTH                   (3U)
#define LPE_MCM_LMDR2_MT(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_MT_SHIFT)) & LPE_MCM_LMDR2_MT_MASK)

#define LPE_MCM_LMDR2_CF1_MASK                   (0xF000000U)
#define LPE_MCM_LMDR2_CF1_SHIFT                  (24U)
#define LPE_MCM_LMDR2_CF1_WIDTH                  (4U)
#define LPE_MCM_LMDR2_CF1(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMDR2_CF1_SHIFT)) & LPE_MCM_LMDR2_CF1_MASK)
/*! @} */

/*! @name LMPECR - LMEM Parity and ECC Control Register */
/*! @{ */

#define LPE_MCM_LMPECR_ECPR_MASK                 (0x800U)
#define LPE_MCM_LMPECR_ECPR_SHIFT                (11U)
#define LPE_MCM_LMPECR_ECPR_WIDTH                (1U)
#define LPE_MCM_LMPECR_ECPR(x)                   (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPECR_ECPR_SHIFT)) & LPE_MCM_LMPECR_ECPR_MASK)

#define LPE_MCM_LMPECR_ER1BR_MASK                (0x800000U)
#define LPE_MCM_LMPECR_ER1BR_SHIFT               (23U)
#define LPE_MCM_LMPECR_ER1BR_WIDTH               (1U)
#define LPE_MCM_LMPECR_ER1BR(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPECR_ER1BR_SHIFT)) & LPE_MCM_LMPECR_ER1BR_MASK)

