zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_MCM.h
#define LPE_MCM_LMPECR_ERNCR_MASK                (0x80000000U)
#define LPE_MCM_LMPECR_ERNCR_SHIFT               (31U)
#define LPE_MCM_LMPECR_ERNCR_WIDTH               (1U)
#define LPE_MCM_LMPECR_ERNCR(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPECR_ERNCR_SHIFT)) & LPE_MCM_LMPECR_ERNCR_MASK)
/*! @} */

/*! @name LMPEIR - LMEM Parity and ECC Interrupt Register */
/*! @{ */

#define LPE_MCM_LMPEIR_V_MASK                    (0x1U)
#define LPE_MCM_LMPEIR_V_SHIFT                   (0U)
#define LPE_MCM_LMPEIR_V_WIDTH                   (1U)
#define LPE_MCM_LMPEIR_V(x)                      (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPEIR_V_SHIFT)) & LPE_MCM_LMPEIR_V_MASK)

#define LPE_MCM_LMPEIR_PEELOC_MASK               (0xF8U)
#define LPE_MCM_LMPEIR_PEELOC_SHIFT              (3U)
#define LPE_MCM_LMPEIR_PEELOC_WIDTH              (5U)
#define LPE_MCM_LMPEIR_PEELOC(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPEIR_PEELOC_SHIFT)) & LPE_MCM_LMPEIR_PEELOC_MASK)

#define LPE_MCM_LMPEIR_PE_MASK                   (0xFF00U)
#define LPE_MCM_LMPEIR_PE_SHIFT                  (8U)
#define LPE_MCM_LMPEIR_PE_WIDTH                  (8U)
#define LPE_MCM_LMPEIR_PE(x)                     (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPEIR_PE_SHIFT)) & LPE_MCM_LMPEIR_PE_MASK)

#define LPE_MCM_LMPEIR_E1B_MASK                  (0xFF0000U)
#define LPE_MCM_LMPEIR_E1B_SHIFT                 (16U)
#define LPE_MCM_LMPEIR_E1B_WIDTH                 (8U)
#define LPE_MCM_LMPEIR_E1B(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPEIR_E1B_SHIFT)) & LPE_MCM_LMPEIR_E1B_MASK)

#define LPE_MCM_LMPEIR_ENC_MASK                  (0xFF000000U)
#define LPE_MCM_LMPEIR_ENC_SHIFT                 (24U)
#define LPE_MCM_LMPEIR_ENC_WIDTH                 (8U)
#define LPE_MCM_LMPEIR_ENC(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMPEIR_ENC_SHIFT)) & LPE_MCM_LMPEIR_ENC_MASK)
/*! @} */

/*! @name LMFAR - LMEM Fault Address Register */
/*! @{ */

#define LPE_MCM_LMFAR_EFADD_MASK                 (0xFFFFFFFFU)
#define LPE_MCM_LMFAR_EFADD_SHIFT                (0U)
#define LPE_MCM_LMFAR_EFADD_WIDTH                (32U)
#define LPE_MCM_LMFAR_EFADD(x)                   (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFAR_EFADD_SHIFT)) & LPE_MCM_LMFAR_EFADD_MASK)
/*! @} */

/*! @name LMFATR - LMEM Fault Attribute Register */
/*! @{ */

#define LPE_MCM_LMFATR_OVR_MASK                  (0x1U)
#define LPE_MCM_LMFATR_OVR_SHIFT                 (0U)
#define LPE_MCM_LMFATR_OVR_WIDTH                 (1U)
#define LPE_MCM_LMFATR_OVR(x)                    (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFATR_OVR_SHIFT)) & LPE_MCM_LMFATR_OVR_MASK)

#define LPE_MCM_LMFATR_PEFMST_MASK               (0xFF0000U)
#define LPE_MCM_LMFATR_PEFMST_SHIFT              (16U)
#define LPE_MCM_LMFATR_PEFMST_WIDTH              (8U)
#define LPE_MCM_LMFATR_PEFMST(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFATR_PEFMST_SHIFT)) & LPE_MCM_LMFATR_PEFMST_MASK)

#define LPE_MCM_LMFATR_PEFW_MASK                 (0x1000000U)
#define LPE_MCM_LMFATR_PEFW_SHIFT                (24U)
#define LPE_MCM_LMFATR_PEFW_WIDTH                (1U)
#define LPE_MCM_LMFATR_PEFW(x)                   (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFATR_PEFW_SHIFT)) & LPE_MCM_LMFATR_PEFW_MASK)

#define LPE_MCM_LMFATR_PEFSIZE_MASK              (0xE000000U)
#define LPE_MCM_LMFATR_PEFSIZE_SHIFT             (25U)
#define LPE_MCM_LMFATR_PEFSIZE_WIDTH             (3U)
#define LPE_MCM_LMFATR_PEFSIZE(x)                (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFATR_PEFSIZE_SHIFT)) & LPE_MCM_LMFATR_PEFSIZE_MASK)

#define LPE_MCM_LMFATR_PEFPRT_MASK               (0xF0000000U)
#define LPE_MCM_LMFATR_PEFPRT_SHIFT              (28U)
#define LPE_MCM_LMFATR_PEFPRT_WIDTH              (4U)
#define LPE_MCM_LMFATR_PEFPRT(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFATR_PEFPRT_SHIFT)) & LPE_MCM_LMFATR_PEFPRT_MASK)
/*! @} */

/*! @name LMFDHR - LMEM Fault Data High Register */
/*! @{ */

#define LPE_MCM_LMFDHR_PEFDH_MASK                (0xFFFFFFFFU)
#define LPE_MCM_LMFDHR_PEFDH_SHIFT               (0U)
#define LPE_MCM_LMFDHR_PEFDH_WIDTH               (32U)
#define LPE_MCM_LMFDHR_PEFDH(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFDHR_PEFDH_SHIFT)) & LPE_MCM_LMFDHR_PEFDH_MASK)
/*! @} */

/*! @name LMFDLR - LMEM Fault Data Low Register */
/*! @{ */

#define LPE_MCM_LMFDLR_PEFDL_MASK                (0xFFFFFFFFU)
#define LPE_MCM_LMFDLR_PEFDL_SHIFT               (0U)
#define LPE_MCM_LMFDLR_PEFDL_WIDTH               (32U)
#define LPE_MCM_LMFDLR_PEFDL(x)                  (((uint32_t)(((uint32_t)(x)) << LPE_MCM_LMFDLR_PEFDL_SHIFT)) & LPE_MCM_LMFDLR_PEFDL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group LPE_MCM_Register_Masks */

/*!
 * @}
 */ /* end of group LPE_MCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_LPE_MCM_H_) */
